In [8]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [10]:
df1 = pd.read_csv("mumbai_house_prices.csv")
df1.head()

,buildupArea_sqft,bathrooms,bhk,flat_price,location1,age_of_property,furnishing,bedrooms,balcony,parking
0,1060,2,2 BHK Flat,0.95,Mira Road East,recent construction,Semi Furnished,2,0,yes
1,525,2,1 BHK Flat,0.93,Borivali East,mid age property,Semi Furnished,1,0,no
2,1065,2,2 BHK Flat,1.48,Bhandup West,new construction,Semi Furnished,2,1,yes
3,1150,2,3 BHK Flat,2.50,Bhandup West,recent construction,Semi Furnished,3,0,yes
4,480,2,1 BHK Flat,1.10,Wadala East,new construction,Unfurnished,1,0,yes

In [11]:
df1.shape

(7483, 10)

In [12]:
df1.columns

Index(['buildupArea_sqft', 'bathrooms', 'bhk', 'flat_price', 'location1',
       'age_of_property', 'furnishing', 'bedrooms', 'balcony', 'parking'],
      dtype='object')

In [26]:
df2 = df1.drop(['age_of_property','furnishing','balcony','parking','bedrooms'],axis='columns')
df2.shape

(7483, 5)

In [27]:
df2.isnull().sum()

buildupArea_sqft    0
bathrooms           0
bhk                 0
flat_price          0
location1           0
dtype: int64

In [28]:
df2.shape

(7483, 5)

In [29]:
df3 = df2.dropna()
df3.isnull().sum()

buildupArea_sqft    0
bathrooms           0
bhk                 0
flat_price          0
location1           0
dtype: int64

In [30]:
df3.shape

(7483, 5)

In [31]:
df3['bhk'] = df3['bhk'].apply(lambda x: int(x.split(' ')[0]))
df3.bhk.unique()

array([2, 1, 3, 4, 6, 5])

In [32]:
df3.head()

   buildupArea_sqft  bathrooms  bhk  flat_price       location1
0              1060          2    2        0.95  Mira Road East
1               525          2    1        0.93   Borivali East
2              1065          2    2        1.48    Bhandup West
3              1150          2    3        2.50    Bhandup West
4               480          2    1        1.10     Wadala East

In [45]:
dummies = pd.get_dummies(df3.location1)
dummies.head(3)

,Agripada,Andheri East,Andheri West,Bandra East,Bandra West,Bhandup East,Bhandup West,Bhayandar East,Bhayandar West,Boisar,...,Vikhroli East,Vikhroli West,Vile Parle East,Vile Parle West,Virar West,Wadala,Wadala East,Worli,other,others
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,True,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [46]:
df4 = pd.concat([df3,dummies],axis='columns')
df4.head()

,buildupArea_sqft,bathrooms,bhk,flat_price,location1,Agripada,Andheri East,Andheri West,Bandra East,Bandra West,...,Vikhroli East,Vikhroli West,Vile Parle East,Vile Parle West,Virar West,Wadala,Wadala East,Worli,other,others
0,1060,2,2,0.95,Mira Road East,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,525,2,1,0.93,Borivali East,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,1065,2,2,1.48,Bhandup West,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,1150,2,3,2.50,Bhandup West,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,480,2,1,1.10,Wadala East,False,False,False,False,False,...,False,False,False,False,False,False,True,False,False,False

In [48]:
df4 = df4.drop('location1',axis='columns')
df4.head(2)

,buildupArea_sqft,bathrooms,bhk,flat_price,Agripada,Andheri East,Andheri West,Bandra East,Bandra West,Bhandup East,...,Vikhroli East,Vikhroli West,Vile Parle East,Vile Parle West,Virar West,Wadala,Wadala East,Worli,other,others
0,1060,2,2,0.95,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,525,2,1,0.93,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [49]:
df4.shape

(7483, 73)

In [52]:
X = df4.drop(['flat_price'],axis='columns')
X.head()

,buildupArea_sqft,bathrooms,bhk,Agripada,Andheri East,Andheri West,Bandra East,Bandra West,Bhandup East,Bhandup West,...,Vikhroli East,Vikhroli West,Vile Parle East,Vile Parle West,Virar West,Wadala,Wadala East,Worli,other,others
0,1060,2,2,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,525,2,1,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,1065,2,2,False,False,False,False,False,False,True,...,False,False,False,False,False,False,False,False,False,False
3,1150,2,3,False,False,False,False,False,False,True,...,False,False,False,False,False,False,False,False,False,False
4,480,2,1,False,False,False,False,False,False,False,...,False,False,False,False,False,False,True,False,False,False

In [53]:
X.shape

(7483, 72)

In [58]:
y = df4.flat_price
y.head(3)

0    0.95
1    0.93
2    1.48
Name: flat_price, dtype: float64

In [59]:
len(y)

7483

In [63]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2,random_state=10)

In [64]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.8360632399321484

In [70]:
def predict_price(location,sqft,bath,bhk):    
    loc_index = np.where(X.columns==location)[0][0]

    x = np.zeros(len(X.columns))
    x[0] = sqft
    x[1] = bath
    x[2] = bhk
    if loc_index >= 0:
        x[loc_index] = 1

    return lr_clf.predict([x])[0]

In [73]:
predict_price('Agripada',590, 2, 2)

C:\Users\akhil\anaconda3\Lib\site-packages\sklearn\utils\validation.py:2749: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

np.float64(2.2859155399498965)

In [74]:
import pickle
with open('mumbai_home_prices_model.pickle','wb') as f:
    pickle.dump(lr_clf,f)

In [75]:
import json
columns = {
    'data_columns' : [col.lower() for col in X.columns]
}
with open("columns.json","w") as f:
    f.write(json.dumps(columns))